#Напишите lambda-функцию, которая принимает число и возвращает его квадрат.
square = lambda x: x ** 2
print(square(77))
